[
  {
    "id": "socialite",
    "name": "Audrey Horne",
    "role": "Socialite",
    "critical": true,
    "role_tier": "core",
    "briefing": "You're the sophisticated daughter of a wealthy family, known for your mysterious charm and impeccable taste. You've been following Morgan's investor pitch and suspect something isn't right about her 'family heritage' claims.",
    "costume": "Elegant 1950s-inspired outfit, saddle shoes, cherry red lipstick",
    "secret": "You know Morgan's family isn't originally from Twin Peaks, yet she's claiming a generations-old heritage recipe. The investors are being deceived.",
    "personality": "Confident, mysterious, observant",
    "objective": "Follow the money trail and expose false heritage claims"
  },
  {
    "id": "detective",
    "name": "Special Agent Dale Cooper",
    "role": "Detective",
    "critical": true,
    "role_tier": "core",
    "briefing": "You're an FBI agent with an unusual investigative style. You're here to celebrate Marlena, but a food blogger's suspicious death has caught your attention. Recipe theft and murder seem unlikely partners, but evidence doesn't lie.",
    "costume": "Black suit, white shirt, skinny black tie, FBI badge, notepad",
    "secret": "You're investigating Cassandra Vale's death, which appears connected to stolen recipes and investor fraud.",
    "personality": "Earnest, methodical, observant",
    "objective": "Gather evidence, document facts, and identify the culprit behind the poisoning"
  },
  {
    "id": "waitress",
    "name": "Shelly Johnson",
    "role": "Diner Waitress",
    "critical": true,
    "role_tier": "core",
    "briefing": "You work at the Double R Diner and know everything that happens in town. You witnessed Morgan's early morning pie purchase, heard Norma report a stolen recipe, and know more than you realized about this tragedy.",
    "costume": "Classic diner uniform with apron, name tag, comfortable shoes",
    "secret": "You have evidence connecting Morgan to the stolen recipe and to Cassandra's death—receipts, conversations, and threatening voicemails.",
    "personality": "Warm, observant, protective",
    "objective": "Piece together what you heard at the diner and reveal the truth"
  },
  {
    "id": "log-lady",
    "name": "The Log Lady",
    "role": "Mystic",
    "critical": true,
    "role_tier": "core",
    "briefing": "You carry a log everywhere that communicates truths others cannot perceive. Your log has been warning about stolen treasures, false heritage, and deadly consequences. The log sees what others miss.",
    "costume": "Flannel shirt, long skirt, glasses, and of course - a log",
    "secret": "Your log predicted someone would die to protect a lie about heritage and recipes. The log knows Morgan's guilt.",
    "personality": "Mysterious, prophetic, earnest",
    "objective": "Deliver the log's warnings and use your special powers (Sanctify Trade, Amplify) to reveal truth"
  },
  {
    "id": "owner",
    "name": "Morgan Blackwood",
    "role": "Venue Owner",
    "critical": true,
    "role_tier": "core",
    "briefing": "You're the elegant owner of a new artisan pie business. You've told investors your 'grandmother's heritage recipe' will make everyone rich. But you stole it from Norma, and when Cassandra found proof, you silenced her with poison.",
    "costume": "Sophisticated business attire, pearls, elegant updo",
    "secret": "You stole Norma's cherry pie recipe, claimed it as family heritage, secured $50K in investor funding based on the lie, and poisoned Cassandra when she threatened to expose you.",
    "personality": "Elegant, ambitious, desperate",
    "objective": "Maintain your facade and protect your lies at all costs"
  },
  {
    "id": "deputy",
    "name": "Andy Brennan",
    "role": "Deputy Sheriff",
    "critical": true,
    "role_tier": "core",
    "briefing": "You're a sweet deputy sheriff who means well and wants to help. You have evidence about Morgan and Cassandra's final meeting, witness statements, and timeline information crucial to solving this case.",
    "costume": "Sheriff's deputy uniform, badge",
    "secret": "You have Cassandra's phone showing her last text to Morgan, and witness statements about their argument.",
    "personality": "Kind-hearted, helpful, earnest",
    "objective": "Help solve the case by sharing your evidence and supporting the investigation"
  },
  {
    "id": "resident-diner",
    "name": "Diner Regular",
    "role": "Village Resident",
    "critical": false,
    "role_tier": "supporting",
    "briefing": "You've eaten breakfast at the Double R Diner every day for twenty years. You know the exact taste of Norma's cherry pie, and you're the first to notice that Morgan's 'heritage' pie is a perfect copy—right down to the secret cinnamon-clove ratio.",
    "costume": "Plaid shirt, trucker hat, denim jacket, coffee mug in hand",
    "secret": "You saw Shelly (the waitress) handing a thick envelope of cash to Cassandra (the blogger) last week in a dark corner of the diner.",
    "personality": "Talkative, loyal to Norma, observant of small habits",
    "objective": "Confirm the recipe was stolen and find out why Shelly was paying the victim"
  },
  {
    "id": "resident-historian",
    "name": "Town Historian",
    "role": "Village Resident",
    "critical": false,
    "role_tier": "supporting",
    "briefing": "You manage the Twin Peaks Historical Society. You've traced every family tree in the valley back to the 1800s. When Morgan claimed her recipe was a 'Blackwood Family Heritage,' you knew she was lying—the Blackwoods were loggers, not bakers.",
    "costume": "Tweed blazer, glasses on a chain, old ledger or book, very proper",
    "secret": "You know that Audrey (the socialite) has been desperately trying to buy up the land under Morgan's shop to expand her family's empire.",
    "personality": "Meticulous, a bit pedantic, obsessed with 'the record'",
    "objective": "Expose the false heritage claim and investigate Audrey's motives"
  },
  {
    "id": "resident-ranger",
    "name": "Forest Ranger",
    "role": "Village Resident",
    "critical": false,
    "role_tier": "supporting",
    "briefing": "You patrol the woods around Ghostwood National Forest. You see things at night that most people ignore. On the morning of the tragedy, you saw a dark SUV speeding away from the pie shop at 4:00 AM.",
    "costume": "Green ranger hat, cargo pants, hiking boots, flashlight (prop)",
    "secret": "You found a discarded bottle of digitalis (heart medication) in the woods near the shop. You've heard Audrey's father uses that exact brand.",
    "personality": "Sturdy, quiet, suspicious of 'city folk'",
    "objective": "Identify the dark SUV and find out who dropped the medicine bottle"
  },
  {
    "id": "observer-coffee-regular",
    "name": "Coffee Regular",
    "role": "Observer",
    "category": "observers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You notice small details other people miss. You're at the Double R every morning, and you've watched Morgan's routine change in recent weeks.",
    "secret": "You overheard Morgan on her phone saying 'the investors will never know' while she thought no one was listening.",
    "objective": "Share observations when asked",
    "personality": "Observant, quiet, detail-oriented",
    "costume": "Casual cafe regular - flannel, comfortable clothes, always with a coffee cup"
  },
  {
    "id": "observer-window-watcher",
    "name": "Window Watcher",
    "role": "Observer",
    "category": "observers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You notice small details other people miss. From your window, you see the comings and goings of the whole neighborhood.",
    "secret": "You saw Cassandra visiting Morgan's shop late one evening last week, and heard raised voices.",
    "objective": "Share observations when asked",
    "personality": "Observant, quiet, detail-oriented",
    "costume": "Comfortable home clothes - cardigan, slippers, binoculars as prop"
  },
  {
    "id": "observer-early-riser",
    "name": "Early Riser",
    "role": "Observer",
    "category": "observers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You notice small details other people miss. You're always up before dawn, and you see things most people sleep through.",
    "secret": "You noticed Morgan's shop lights were on at 5 AM the morning Cassandra died, which is unusual.",
    "objective": "Share observations when asked",
    "personality": "Observant, quiet, detail-oriented",
    "costume": "Jogging gear or dog-walking outfit - athletic wear, running shoes"
  },
  {
    "id": "observer-night-owl",
    "name": "Night Owl",
    "role": "Observer",
    "category": "observers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You notice small details other people miss. You're a night person who sees the town's late-night secrets.",
    "secret": "You saw someone matching Morgan's description leaving the diner parking lot very late the night before Cassandra's death.",
    "objective": "Share observations when asked",
    "personality": "Observant, quiet, detail-oriented",
    "costume": "Dark colors, comfortable nighttime attire, thermos of coffee"
  },
  {
    "id": "observer-concerned-neighbor",
    "name": "Concerned Neighbor",
    "role": "Observer",
    "category": "observers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You notice small details other people miss. You keep an eye on your neighborhood and notice when things seem off.",
    "secret": "You noticed Morgan seemed extremely nervous and jumpy the last few days, very unlike her usual composed self.",
    "objective": "Share observations when asked",
    "personality": "Observant, quiet, detail-oriented",
    "costume": "Neat casual - polo shirt, khakis, sensible shoes"
  },
  {
    "id": "observer-delivery-regular",
    "name": "Delivery Route Regular",
    "role": "Observer",
    "category": "observers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You notice small details other people miss. Your delivery route takes you past all the key locations every day.",
    "secret": "You noticed Morgan receiving an unusually large shipment of ingredients that she seemed anxious to hide.",
    "objective": "Share observations when asked",
    "personality": "Observant, quiet, detail-oriented",
    "costume": "Delivery uniform or postal worker outfit, comfortable shoes, clipboard"
  },
  {
    "id": "gossip-salon-regular",
    "name": "Salon Regular",
    "role": "Gossip Carrier",
    "category": "gossip_carriers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You have heard five versions of the same story. The salon is where all the town gossip flows.",
    "secret": "You heard a rumor that Morgan's 'family recipe' was actually bought from a traveling salesman, though this might just be gossip.",
    "objective": "Spread conversation starters, not solutions",
    "personality": "Chatty, social, well-connected",
    "costume": "Stylish outfit, salon-fresh hair, manicured nails"
  },
  {
    "id": "gossip-book-club",
    "name": "Book Club Member",
    "role": "Gossip Carrier",
    "category": "gossip_carriers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You have heard five versions of the same story. Book club discussions always drift to town drama.",
    "secret": "Someone at book club mentioned they heard Cassandra was writing an exposé, but details were vague.",
    "objective": "Spread conversation starters, not solutions",
    "personality": "Chatty, social, well-connected",
    "costume": "Literary chic - reading glasses, book as prop, cozy sweater"
  },
  {
    "id": "gossip-realtor-friend",
    "name": "Realtor Friend",
    "role": "Gossip Carrier",
    "category": "gossip_carriers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You have heard five versions of the same story. Real estate circles know everyone's business in this town.",
    "secret": "You heard Morgan was desperately trying to secure more funding, though you don't know why she needed it so urgently.",
    "objective": "Spread conversation starters, not solutions",
    "personality": "Chatty, social, well-connected",
    "costume": "Business casual - blazer, business cards, phone always in hand"
  },
  {
    "id": "gossip-town-blogger",
    "name": "Town Blogger",
    "role": "Gossip Carrier",
    "category": "gossip_carriers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You have heard five versions of the same story. Your blog covers local events and you've heard it all.",
    "secret": "You heard rumors that Audrey and Morgan had some kind of business rivalry, but the details are fuzzy.",
    "objective": "Spread conversation starters, not solutions",
    "personality": "Chatty, social, well-connected",
    "costume": "Trendy casual - laptop bag, camera, fashionable accessories"
  },
  {
    "id": "gossip-friend-of-friend",
    "name": "Friend of a Friend",
    "role": "Gossip Carrier",
    "category": "gossip_carriers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You have heard five versions of the same story. You know someone who knows someone, and information flows through you.",
    "secret": "A friend mentioned seeing Morgan and the deputy having an intense conversation, but you don't know what it was about.",
    "objective": "Spread conversation starters, not solutions",
    "personality": "Chatty, social, well-connected",
    "costume": "Casual social - comfortable but stylish, phone with many contacts"
  },
  {
    "id": "noticer-photographer",
    "name": "Town Photographer",
    "role": "Noticer",
    "category": "noticers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You tend to catch moments as they happen. Photography has taught you to see things others miss.",
    "secret": "You noticed someone looked tense when Cassandra's name came up in conversation at the diner last week.",
    "objective": "If you feel like it, take candid photos. If not, just enjoy watching the room.",
    "personality": "Perceptive, artistic, present",
    "costume": "Casual artsy - camera around neck, comfortable clothes, photographer vest optional"
  },
  {
    "id": "noticer-scrapbook-friend",
    "name": "Scrapbook Friend",
    "role": "Noticer",
    "category": "noticers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You tend to catch moments as they happen. You love documenting memories and noticing little details.",
    "secret": "You noticed the way Morgan's smile didn't quite reach her eyes at the last town gathering.",
    "objective": "If you feel like it, take candid photos. If not, just enjoy watching the room.",
    "personality": "Perceptive, artistic, present",
    "costume": "Crafty casual - decorative accessories, scrapbook or journal, comfortable clothes"
  },
  {
    "id": "noticer-detail-spotter",
    "name": "Detail Spotter",
    "role": "Noticer",
    "category": "noticers",
    "role_tier": "supporting",
    "critical": false,
    "briefing": "You tend to catch moments as they happen. You naturally pick up on small changes and subtle cues.",
    "secret": "You noticed Shelly seemed distracted and worried lately, different from her usual cheerful self.",
    "objective": "If you feel like it, take candid photos. If not, just enjoy watching the room.",
    "personality": "Perceptive, artistic, present",
    "costume": "Observant casual - notepad, comfortable clothes, keen eye for details"
  }
]
