[
  {
    "id": "socialite",
    "name": "Audrey Horne",
    "role": "Socialite",
    "briefing": "You're the sophisticated daughter of a wealthy family, known for your mysterious charm and impeccable taste. You've been following Morgan's investor pitch and suspect something isn't right about her 'family heritage' claims.",
    "costume": "Elegant 1950s-inspired outfit, saddle shoes, cherry red lipstick",
    "secret": "You know Morgan's family isn't originally from Twin Peaks, yet she's claiming a generations-old heritage recipe. The investors are being deceived.",
    "personality": "Confident, mysterious, observant",
    "objective": "Follow the money trail and expose false heritage claims"
  },
  {
    "id": "detective",
    "name": "Special Agent Dale Cooper",
    "role": "Detective",
    "briefing": "You're an FBI agent with an unusual investigative style. You're here to celebrate Marlena, but a food blogger's suspicious death has caught your attention. Recipe theft and murder seem unlikely partners, but evidence doesn't lie.",
    "costume": "Black suit, white shirt, skinny black tie, FBI badge, notepad",
    "secret": "You're investigating Cassandra Vale's death, which appears connected to stolen recipes and investor fraud.",
    "personality": "Earnest, methodical, observant",
    "objective": "Gather evidence, document facts, and identify the culprit behind the poisoning"
  },
  {
    "id": "waitress",
    "name": "Shelly Johnson",
    "role": "Diner Waitress",
    "briefing": "You work at the Double R Diner and know everything that happens in town. You witnessed Morgan's early morning pie purchase, heard Norma report a stolen recipe, and know more than you realized about this tragedy.",
    "costume": "Classic diner uniform with apron, name tag, comfortable shoes",
    "secret": "You have evidence connecting Morgan to the stolen recipe and to Cassandra's death—receipts, conversations, and threatening voicemails.",
    "personality": "Warm, observant, protective",
    "objective": "Piece together what you heard at the diner and reveal the truth"
  },
  {
    "id": "log-lady",
    "name": "The Log Lady",
    "role": "Mystic",
    "briefing": "You carry a log everywhere that communicates truths others cannot perceive. Your log has been warning about stolen treasures, false heritage, and deadly consequences. The log sees what others miss.",
    "costume": "Flannel shirt, long skirt, glasses, and of course - a log",
    "secret": "Your log predicted someone would die to protect a lie about heritage and recipes. The log knows Morgan's guilt.",
    "personality": "Mysterious, prophetic, earnest",
    "objective": "Deliver the log's warnings and use your special powers (Sanctify Trade, Amplify) to reveal truth"
  },
  {
    "id": "owner",
    "name": "Morgan Blackwood",
    "role": "Venue Owner",
    "briefing": "You're the elegant owner of a new artisan pie business. You've told investors your 'grandmother's heritage recipe' will make everyone rich. But you stole it from Norma, and when Cassandra found proof, you silenced her with poison.",
    "costume": "Sophisticated business attire, pearls, elegant updo",
    "secret": "You stole Norma's cherry pie recipe, claimed it as family heritage, secured $50K in investor funding based on the lie, and poisoned Cassandra when she threatened to expose you.",
    "personality": "Elegant, ambitious, desperate",
    "objective": "Maintain your facade and protect your lies at all costs"
  },
  {
    "id": "deputy",
    "name": "Andy Brennan",
    "role": "Deputy Sheriff",
    "briefing": "You're a sweet deputy sheriff who means well and wants to help. You have evidence about Morgan and Cassandra's final meeting, witness statements, and timeline information crucial to solving this case.",
    "costume": "Sheriff's deputy uniform, badge",
    "secret": "You have Cassandra's phone showing her last text to Morgan, and witness statements about their argument.",
    "personality": "Kind-hearted, helpful, earnest",
    "objective": "Help solve the case by sharing your evidence and supporting the investigation"
  }
]
