{
  "title": "Cherry Lies",
  "subtitle": "A Twin Peaks Mystery for Marlena's Bridal Shower",
  "setting": "The bridal shower takes place at a cozy venue reminiscent of the Double R Diner. The guests have gathered to celebrate Marlena, but beneath the cheerful atmosphere lies a tale of stolen recipes, false heritage claims, and deadly ambition.",
  "overview": "In a town where secrets hide behind warm smiles and cherry pie, someone has crossed a dangerous line. What began as recipe theft has ended in tragedy. When Cassandra, a food blogger investigating local culinary heritage, is found dead from a poisoned pie slice, guests must unravel the truth. Was it about money, pride, or protecting a legacy? And was Cassandra just a blogger, or did she have a deeper connection to this town?",
  "theMurder": {
    "concept": "Legacy & Betrayal",
    "object": "Poisoned Cherry Pie Slice",
    "victim": "Cassandra Vale",
    "victimDescription": "A food blogger who was actually Norma's secret granddaughter, uncovering the theft of her family's most precious legacy.",
    "causeOfDeath": "Poisoned cherry pie slice (Digitalis)",
    "timeOfDeath": "Early morning, before the bridal shower began",
    "location": "Outside Morgan's new artisan pie shop"
  },
  "theMurderer": {
    "character": "Morgan Blackwood (Venue Owner)",
    "motive": "Cassandra found proof that Morgan stole the recipe and threatened her $50K investor deal. Morgan stole Audrey's SUV and planted her father's medication to frame the socialite, and tried to frame the waitress by making her secret payments look like hush money.",
    "method": "Poisoned a slice of the stolen cherry pie recipe and gave it to Cassandra as a 'sample' to 'clear things up'",
    "coverUp": "Morgan is framing Audrey with a planted medicine bottle and framing Shelly by making their business arrangement look suspicious."
  },
  "solution": "Morgan Blackwood stole Norma's cherished recipe to secure investor funding. When she discovered Cassandra—Norma's secret granddaughter—had proof of the theft, Morgan stole Audrey's SUV to travel to the shop undetected and poisoned Cassandra with digitalis. She planted the medicine bottle to frame Audrey and made Shelly's secret 'spy' payments look like hush money to shift the blame. The cupcakes reveal the layer of lies before confirming Morgan's guilt.",
  "hostNotes": "This version includes multiple red herrings: Audrey's 'stolen' SUV and medication, and Shelly's 'hush money' (which was actually pay for spying). The major twist is that Cassandra was Norma's granddaughter. Ensure the Ranger reveals the medicine bottle in Phase 2 to heat up the pressure on Audrey!",
  "phases": {
    "intro": {
      "name": "Arrival & First Warnings",
      "timing": "0:00-0:20",
      "description": "Guests arrive, receive character packets, and open Envelope 1. The Log Lady begins delivering cryptic warnings about theft and false heritage."
    },
    "mid": {
      "name": "Investigation Deepens",
      "timing": "0:20-0:40",
      "description": "Envelope 2 opened. Clues about recipe theft, secret photos, and investor meetings emerge. Players begin trading information."
    },
    "pre-final": {
      "name": "The Web Tightens",
      "timing": "0:40-0:55",
      "description": "Envelope 3 opened. Critical evidence surfaces: proof of theft, motive becomes clear, Morgan's desperation shows."
    },
    "final": {
      "name": "Truth Before Reveal",
      "timing": "0:55-1:10",
      "description": "Envelope 4 opened. Final clues confirm Morgan's guilt. All players prepare for the cupcake reveal ceremony."
    }
  },
  "cupcakeReveal": [
    "The recipe was stolen...",
    "From Norma's kitchen.",
    "Cassandra knew the truth.",
    "She was Norma's blood.",
    "A stolen SUV in the dark.",
    "A bottle planted to frame.",
    "Audrey is innocent.",
    "Shelly's cash was a spy's pay.",
    "Morgan's lies are toxic.",
    "A poisoned sample of success.",
    "Morgan Blackwood is the killer.",
    "The legacy returns home.",
    "Secrets can't stay buried.",
    "Celebrate Marlena!"
  ],
  "anonymousTips": [
    "Someone was seen purchasing a whole cherry pie the morning of the murder...",
    "The Log Lady's log has been warning about elegance hiding darkness...",
    "Check Laura's phone messages - she was meeting someone important..."
  ]
}
